# Demo Notebook for CS411 Project Track 1

In addition to our interface, we have scripts for inserting, updating, and deleting information in our database. This notebook will demonstrate those scripts as well as additional features of our project. 

### Goal of project: 
To cluster SQL queries from an introductory CS Databases course by question, for structure and semantics. Audience: TAs and Instructors

In [1]:
# Import statements
import crud_operations as co # this imports our crud operations class

import mongo_operations as m

## CRUD Operations: SQL

This next section shows off our basic CRUD operations. We loaded the database with JSON files obtained from Professor Abdu, which contained PraireLearn homework queries from Fall 2019 database class. 

For this database, we have two tables:
* Queries(queryNum, queryId, variantID, queryText)
* Questions(variantID, title)

### Create/Read

In [2]:
# First, create an instance we can use that uses pl_queries db
db = co.MySQLDB("pl_queries")

In [3]:
# Read current database state
print("This is reading the Questions in our DB:")
for entry in db.read_all_questions():
    print(entry)

This is reading the Questions in our DB:
(3689952, 'Toy Database for practice')
(3893280, 'Find hard working students')
(3893281, 'ECE Students taking CS Courses')
(3893282, 'Find students who take courses not from own department')
(3893285, 'Products released before a particular product')
(3893287, 'Who are the best sale shoppers?')
(3893288, 'Who purchased Samsung phones?')
(3902462, 'Looking for grade 15 employees')
(3902464, 'Who is richer than the IT Manager???')
(3902465, 'Looking for Sales Reps or IT Support with salary grade 12 or 13')
(3902466, 'Who works in London')
(3902467, 'Making more than $7000 or not an IT Support!!!')
(4014112, 'Departments with the highest number employees!')
(4014114, 'Find the special employee')
(4014115, 'Where has Ben been to?')
(4017605, 'Number of employees per department.')
(4017607, 'Which mangers earns more than the average salary of their employees')
(4388082, 'Find certain Employees Working in Dubai or in Sales Department')
(4388083, 'Find most recently hired employees in each department')

In [4]:
# Read current database queries
all_queries = db.read_all_queries()

print("Number of queries:", len(all_queries))

Number of queries: 1419

In [5]:
print("Reading the Queries in our DB:\n")

for idx, tup in enumerate(all_queries):
    # print only the first 100 queries 
    if idx < 50:
        print(tup)

Reading the Queries in our DB:

(1, 313665, 4388082, "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and\n        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and\n        (e.empName like '_a%' or e.empName like '_i%')\norder by e.empName asc, d.deptName desc")
(2, 34820, 4388082, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e join Department d on e.deptID = d.deptID \nWHERE ((d.deptLocation = 'Dubai') OR (d.deptName = 'Sales')) AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND ((e.empName LIKE '_A%' )OR (e.empName LIKE '_I%'))\nORDER BY e.empName,  d.deptName DESC\n\n")
(3, 325288, 4388082, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND e.annualSalary >= 84000 AND e.annualSalary <= 120000 AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;")
(4, 36577, 4388082, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d, Employee e\nWHERE e.deptID = d.deptID and (deptLocation = 'Dubai' or deptName = 'Sales') and \n(annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)")
(5, 342776, 4388082, "SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E, Department D\nWHERE (E.deptID = D.deptID) AND (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND (E.empName LIKE '_i%' OR E.empName LIKE '_a%')\nORDER BY E.empName, D.deptName DESC")
(6, 31817, 4388082, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND (annualSalary)/12 >= 7000 AND (annualSalary)/12 <=10000 AND (empName LIKE '_a%' OR empName LIKE '_i%')\nORDER BY empName, deptName DESC;")
(7, 331548, 4388082, "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e join Department d\non e.deptID = d.deptID\nwhere d.deptLocation = 'Dubai' \nor d.deptName = 'Sales' \nand ((e.annualSalary / 12) >= 7000 and (e.annualSalary / 12) <= 10000)\nand (e.empName like '_A%' or e.empName like '_I%')\norder by e.empName asc, d.deptName desc")
(8, 131080, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Department d JOIN Employee e ON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (\ne.annualSalary <= 100000 AND e.annualSalary >= 70000) AND (\ne.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName ASC, d.deptName DESC\n')
(9, 128458, 4388082, 'SELECT e.empName as Name, e.annualSalary as Salary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee as e\nINNER JOIN Department as d\nON d.deptID = e.deptID\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 <= 10000 AND e.annualSalary/12 >= 7000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY d.deptName DESC')
(10, 127187, 4388082, 'SELECT Emp.empName, Emp.annualSalary, Dept.deptName, Dept.deptLocation, Emp.jobTitle\nFROM Department Dept NATURAL JOIN Employee Emp\nWHERE (Dept.deptLocation = "Dubai" OR Dept.deptName = "Sales") AND \n        (Emp.annualSalary >= 12 * 7000 AND Emp.annualSalary <= 12 * 10000) AND \n        (Emp.empName LIKE \'_A%\' OR Emp.empName LIKE \'_I%\')\nORDER BY Emp.empName, Dept.deptName DESC')
(11, 124539, 4388082, "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales')\nAND (Employee.annualSalary/12 >= 7000 AND Employee.annualSalary/12 <= 10000)\nAND (SUBSTR(Employee.empName, 2, 1) = 'A'  OR SUBSTR(Employee.empName, 2, 1) = 'I')")
(12, 126177, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Department d INNER JOIN Employee e on e.deptID = d.deptID\nWHERE (d.deptLocation = \'Dubai\' OR d.deptName = \'Sales\') AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")')
(13, 83742, 4388082, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e\nJOIN Department d ON e.deptID = d.deptID\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary >= 7000 OR e.annualSalary <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName ASC, d.deptName DESC\n;")
(14, 336531, 4388082, 'SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle \nFROM Department D join Employee E\non D.deptID = E.deptID\nwhere (D.deptLocation = "Dubai" or D.deptName= "sales")\nand ((E.annualSalary/12) >= 7000 and (E.annualSalary/12) <= 10000) \n-- and (E.empName like \'_a%\' or \'_i%\')\norder by E.empName, D.deptName DESC')
(15, 331920, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <=10000) AND (e.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName, d.deptName DESC')
(16, 35368, 4388082, 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE deptName = "Sales" AND annualSalary/12 >= 7000 AND annualSalary/12 <= 10000 AND (empName LIKE "_A%" OR empName LIKE "_I%")\nAND jobTitle LIKE "Sales%"\nORDER BY empName, deptName DESC')
(17, 313229, 4388082, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (annualSalary / 12 >= 7000 AND annualSalary / 12 <= 10000) AND (empName LIKE '_A%' OR empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;")
(18, 33496, 4388082, 'SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle FROM Employee AS E\nJOIN Department AS D ON D.deptID = E.deptId\nWHERE\n    (D.deptLocation = "Dubai" OR D.deptName = "Sales") AND\n    (E.annualSalary / 12 >= 7000 AND E.annualSalary / 12 <= 10000) AND\n    (E.empName LIKE "_A%" OR E.empName LIKE "_I%")\nORDER BY E.empName, D.deptName DESC')
(19, 5259, 4388082, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR (deptName = 'Sales' AND annualSalary >= 84000 AND annualSalary <= 120000)) AND (empName LIKE '_I%' OR empName LIKE '_A%') \nORDER BY empName ASC, deptName DESC;")
(20, 5271, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM (Employee e) NATURAL JOIN (Department d)\nWHERE (d.deptLocation = "Dubai" OR d.deptName = "Sales") AND (e.annualSalary >= 84000 AND e.annualSalary <= 120000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY e.empName, d.deptName DESC')
(21, 332195, 4388082, 'Select emp.empName, emp.annualSalary, dep.deptName, dep.deptLocation, emp.jobTitle\nFrom Department dep Natural Join Employee emp\nWHERE (dep.deptLocation = "Dubai" OR dep.deptName = "Sales") AND (emp.annualSalary / 12 >= 7000 AND emp.annualSalary/12 <= 10000) AND (emp.empName LIKE \'_a%\' OR emp.empName LIKE \'_i%\')')
(22, 332008, 4388082, "select Employee.empName, Employee.annualSalary, Department.deptName,Department.deptLocation, Employee.jobTitle\nfrom Employee natural join Department\nwhere (Department.deptLocation = 'Dubai' or deptName = 'Sales') and Employee.annualSalary/12>=7000 and Employee.annualSalary/12<= 10000 and (Employee.empName like '_A%' or Employee.empName like '_I%')\norder by Employee.empName, Department.deptName desc")
(23, 11185, 4388082, "select E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nfrom Employee E join Department D on E.deptID = D.deptID\nwhere (D.deptLocation = 'Dubai' or D.deptName = 'Sales') and ((E.annualSalary/12)>= 7000 and (E.annualSalary/12) <= 10000) and (E.empName LIKE '_A%' or E.empName LIKE '_I%')\norder by E.empName, D.deptName desc")
(24, 32963, 4388082, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e JOIN Department d ON e.deptID = d.deptID \nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary / 12 >= 7000 AND e.annualSalary / 12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC")
(25, 12133, 4388082, "SELECT E1.empName, E1.annualSalary, D1.deptName, D1.deptLocation, E1.jobTitle\nFROM (Employee E1 INNER JOIN Department D1 ON D1.deptID = E1.DeptID)\nWHERE (D1.deptLocation = 'Dubai' OR D1.deptName = 'Sales') AND (E1.annualSalary/12 >= 7000 AND E1.annualSalary/12 <= 10000) AND (E1.empName LIKE '_A%' OR E1.empName LIKE '_I%')\nORDER BY E1.empName, D1.deptName DESC")
(26, 34727, 4388082, 'Select Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFrom Department, Employee\nWhere Employee.deptID = Department.deptID AND Employee.annualSalary>= 94000 AND Employee.annualSalary<= 120000 AND ((Employee.empname LIKE \'_a%\') OR (Employee.empname LIKE \'_i%\')) AND ((Department.deptlocation = "Dubai") OR (Department.deptName = "Sales"))\nOrder by Employee.empname, Department.deptName DESC')
(27, 5308, 4388082, "SELECt Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle\nFROM Employee, Department\nWHERE (Employee.deptID = Department.deptID) AND (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.annualSalary/12 <= 10000.0 && Employee.annualSalary/12 >= 7000.0) AND (Employee.empName LIKE '_a%' OR Employee.empName LIKE '_i%')")
(28, 35941, 4388082, 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Department, Employee\nWHERE (deptName = "Sales") AND (annualSalary/12 BETWEEN 7000 AND 10000) AND (empName LIKE \'_A%\' OR empName LIKE \'_I%\') AND jobTitle LIKE "Sales%"\nORDER BY empName ASC, deptName DESC')
(29, 4370, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e INNER JOIN Department d ON e.deptID = d.deptId\nWHERE ((d.deptLocation LIKE "Dubai" OR d.deptName LIKE "Sales") AND (e.annualSalary/12 BETWEEN 7000 AND 10000)) AND (e.empName LIKE "_a%" OR e.empName LIKE "_i%")\nORDER BY e.empName ASC, d.deptName DESC')
(30, 34723, 4388082, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE \n    (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND \n    ((e.annualSalary / 12 >= 7000) AND (e.annualSalary / 12 <= 10000)) AND \n    (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName, d.deptName DESC;")
(31, 5126, 4388082, 'SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E, Department D\nWHERE E.deptId = D.deptId AND (D.deptLocation = "Dubai" OR D.deptName = "Sales")\n    AND (E.annualSalary/12 >= 7000 AND E.annualSalary/12 <=10000) \n    AND (E.empName LIKE \'_A%\' OR E.empName LIKE \'_I%\')')
(32, 126556, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e, Department d\nWHERE (d.deptID = e.deptID) AND (d.deptLocation = \'DUBAI\' OR d.deptName = \'SALES\') AND (e.annualSalary/12 BETWEEN 7000 AND 10000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")')
(33, 127606, 4388082, "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation='Dubai' or d.deptName='Sales')\nand (e.annualSalary/12 >= 7000 or e.annualSalary <= 10000)\nand (e.empName like '%a%' or e.empName like '%i%')")
(34, 37267, 4388082, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee NATURAL JOIN Department\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') AND annualSalary >= 7000 AND annualSalary <= 100000 AND empName LIKE '_i%'\nORDER BY empName ASC, deptName DESC")
(35, 30481, 4388082, 'SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee e\nNATURAL JOIN Department d\nWHERE (deptLocation LIKE "Dubai" OR deptName LIKE "Sales") AND\n    (annualSalary >= 7000*12 AND annualSalary <= 10000*12) AND\n    (empName LIKE "_A%" OR empName LIKE "_I%" OR empName LIKE "_a%" OR empName LIKE "_i%")\nORDER BY empName, deptName DESC')
(36, 36594, 4388082, "SELECT E.empName, E.annualSalary, D.deptName, D.deptLocation, E.jobTitle\nFROM Employee E\n    JOIN Department D ON D.deptID = E.deptID\nWHERE (D.deptLocation = 'Dubai' OR D.deptName = 'Sales') AND\n      ((E.annualSalary / 12) >= 7000 AND (E.annualSalary / 12) <= 10000) AND\n      (empName LIKE '_A%' OR empName LIKE '_I%' OR empName LIKE '_a%' OR empName LIKE '_i%')")
(37, 5753, 4388082, 'select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e inner join Department d on e.deptId = d.deptId\nwhere (d.deptLocation = "Dubai" or d.deptName = "Sales") and \n((e.annualSalary / 12) <= 10000 or (e.annualSalary / 12) >= 7000) and\n(e.empName like "_A%" or e.empName like "_I%")')
(38, 37112, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e NATURAL JOIN Department d\nWHERE (d.deptLocation = \'Dubai\' OR d.deptName = \'Sales\') AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE "_A%" OR e.empName LIKE "_I%")\nORDER BY e.empName, d.deptName DESC')
(39, 5791, 4388082, 'select empName, annualSalary, deptName, deptLocation, jobTitle\nfrom Employee natural join Department\nwhere (deptLocation = "Dubai" or deptName = "Sales")\n    and (annualSalary / 12 >= 7000 and annualSalary / 12 <= 10000)\n    and (empName like "_A%" or empName like "_I%")\norder by empName, deptName desc')
(40, 36387, 4388082, "SELECT Employee.empName, Employee.annualSalary, Department.deptName, Department.deptLocation, Employee.jobTitle \nFROM Employee\nINNER JOIN Department on Employee.deptId = Department.deptId\nWHERE (Department.deptLocation = 'Dubai' OR Department.deptName = 'Sales') AND (Employee.empName LIKE '_I%' OR Employee.empName LIKE '_A%')\nGROUP BY Employee.empId\nORDER BY Employee.empName ASC, Department.deptName DESC;")
(41, 336388, 4388082, "SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee as e\nJOIN Department as d\nON e.deptID = d.deptID\nWHERE (d.deptLocation = 'Dubai' OR d.deptName = 'Sales') AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE '_A%' OR e.empName LIKE '_I%')\nORDER BY e.empName ASC, d.deptName DESC")
(42, 331540, 4388082, "Select E.empName,E.annualSalary,D.deptName,D.deptLocation,E.jobTitle\nfrom Employee E,Department D,Salary_Grade S\nwhere E.deptID=D.deptID and E.annualSalary >= S.minAnnualSalary and E.annualSalary <= S.maxAnnualSalary and\n(D.deptLocation LIKE 'Dubai' OR D.deptName LIKE 'Sales') and \n(E.annualSalary/12 >= 7000 and E.annualSalary/12 <= 10000) and\n(E.empName LIKE '_A%' OR E.empName LIKE '_I%')\norder by E.empName,D.deptName DESC")
(43, 36209, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle \nFROM Employee e, Department d\nWHERE e.deptId = d.deptId \n    AND (d.deptLocation = "Dubai" OR d.deptName = "Sales")\n    AND ((e.empName LIKE "_a%") OR (e.empName LIKE "_i%"));\n    ')
(44, 33198, 4388082, 'SELECT e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nFROM Employee e, Department d\nWHERE ((d.deptName = "Sales" AND e.jobTitle LIKE \'%Sales%\')) AND (e.annualSalary/12 >= 7000 AND e.annualSalary/12 <= 10000) AND (e.empName LIKE \'_A%\' OR e.empName LIKE \'_I%\') AND e.annualSalary IN (SELECT e2.annualSalary FROM Employee e2, Salary_Grade s WHERE e2.annualSalary >= s.minAnnualSalary AND e2.annualSalary <= s.maxAnnualSalary)\nORDER BY e.empName, d.deptName DESC')
(45, 5435, 4388082, "SELECT empName, annualSalary, deptName, deptLocation, jobTitle\nFROM Employee emp\nJOIN Department dept\nON dept.deptID = emp.deptID\nWHERE (deptLocation = 'Dubai' OR deptName = 'Sales') \nAND (annualSalary >= 84000 AND annualSalary\t<= 120000) \nAND (empName LIKE '_A%' OR empName LIKE '_I%')")
(46, 260731, 4388083, 'SELECT e.empName, e.annualSalary/12 as monthlySalary, d.deptName, e.hireDate\nFROM Employee e JOIN Department d ON e.deptID = d.deptID\nWHERE e.hireDate IN (SELECT MAX(hireDate) FROM Employee where deptID=e.deptID) AND\ne.annualSalary >=(SELECT minAnnualSalary FROM Salary_Grade WHERE grade =12) AND e.annualSalary <=(SELECT maxAnnualSalary FROM Salary_Grade WHERE grade =12)\nORDER BY e.empName, monthlySalary DESC')
(47, 37657, 4017605, 'SELECT d.deptName, d.deptLocation, COUNT(e.deptID) as empCnt\nFROM Department d LEFT OUTER JOIN Employee e on d.deptID = e.deptID \nGROUP BY d.deptID\nORDER BY empCnt ASC, d.deptName DESC')
(48, 36038, 4017605, 'Select d.deptName, d.deptLocation, Count(e.empID) as empCNT\nfrom Department d Left outer join Employee e On (d.deptID = e.deptID)\ngroup by  d.deptID\norder by empCNT, d.deptName DESC')
(49, 325288, 4017605, 'SELECT d.deptName, d.deptLocation, COUNT(e.empID) as empCnt\nFROM Department d LEFT JOIN Employee e ON (d.deptID = e.deptID)\nGROUP BY d.deptID\nORDER BY empCnt, d.deptName DESC;')
(50, 34406, 4017605, 'SELECT d.deptName, d.deptLocation, COUNT(DISTINCT(e.empID))\nFROM Employee e RIGHT OUTER JOIN Department d ON e.deptID = d.deptID\nGROUP BY d.deptID\nORDER BY COUNT(DISTINCT(e.empID)), d.deptName DESC')

We can also insert into the database by creating another question or query.

In [6]:
print("This is inserting a new Question")
question = input("Enter a question title: ")
variantId = input("Enter variantID: ")
db.create_question(variantId, question)

This is inserting a new Question
Enter a question title: Why is the ocean blue?
Enter variantID: 12345
Inserted the question: Why is the ocean blue?

In [7]:
# We can check by using our read functionality
for entry in db.read_all_questions():
    print(entry)

(12345, 'Why is the ocean blue?')
(3689952, 'Toy Database for practice')
(3893280, 'Find hard working students')
(3893281, 'ECE Students taking CS Courses')
(3893282, 'Find students who take courses not from own department')
(3893285, 'Products released before a particular product')
(3893287, 'Who are the best sale shoppers?')
(3893288, 'Who purchased Samsung phones?')
(3902462, 'Looking for grade 15 employees')
(3902464, 'Who is richer than the IT Manager???')
(3902465, 'Looking for Sales Reps or IT Support with salary grade 12 or 13')
(3902466, 'Who works in London')
(3902467, 'Making more than $7000 or not an IT Support!!!')
(4014112, 'Departments with the highest number employees!')
(4014114, 'Find the special employee')
(4014115, 'Where has Ben been to?')
(4017605, 'Number of employees per department.')
(4017607, 'Which mangers earns more than the average salary of their employees')
(4388082, 'Find certain Employees Working in Dubai or in Sales Department')
(4388083, 'Find most recently hired employees in each department')

In [8]:
# We can do the same for queries

query = input("Insert a query: ")

db.create_query(8888, 12345, query)

Insert a query: SELECT * FROM Oceans WHERE color='blue'
Inserted "8888" for question 12345

In [9]:
new_all_queries = db.read_all_queries()
print("Number of queries:", len(new_all_queries)) # Should be 1 more than last time we looked

Number of queries: 1420

### Update

In [10]:
print(db.read_all_questions())
qid = input("Enter question ID to be updated: ")
q = input("Enter new value for question: ")
db.update_question_by_id(qid, q)

((12345, 'Why is the ocean blue?'), (3689952, 'Toy Database for practice'), (3893280, 'Find hard working students'), (3893281, 'ECE Students taking CS Courses'), (3893282, 'Find students who take courses not from own department'), (3893285, 'Products released before a particular product'), (3893287, 'Who are the best sale shoppers?'), (3893288, 'Who purchased Samsung phones?'), (3902462, 'Looking for grade 15 employees'), (3902464, 'Who is richer than the IT Manager???'), (3902465, 'Looking for Sales Reps or IT Support with salary grade 12 or 13'), (3902466, 'Who works in London'), (3902467, 'Making more than $7000 or not an IT Support!!!'), (4014112, 'Departments with the highest number employees!'), (4014114, 'Find the special employee'), (4014115, 'Where has Ben been to?'), (4017605, 'Number of employees per department.'), (4017607, 'Which mangers earns more than the average salary of their employees'), (4388082, 'Find certain Employees Working in Dubai or in Sales Department'), (4388083, 'Find most recently hired employees in each department'))
Enter question ID to be updated: 12345
Enter new value for question: Why is the sky blue?
Updated Questions for variantID=  12345

In [11]:
print(db.read_all_questions())

((12345, 'Why is the sky blue?'), (3689952, 'Toy Database for practice'), (3893280, 'Find hard working students'), (3893281, 'ECE Students taking CS Courses'), (3893282, 'Find students who take courses not from own department'), (3893285, 'Products released before a particular product'), (3893287, 'Who are the best sale shoppers?'), (3893288, 'Who purchased Samsung phones?'), (3902462, 'Looking for grade 15 employees'), (3902464, 'Who is richer than the IT Manager???'), (3902465, 'Looking for Sales Reps or IT Support with salary grade 12 or 13'), (3902466, 'Who works in London'), (3902467, 'Making more than $7000 or not an IT Support!!!'), (4014112, 'Departments with the highest number employees!'), (4014114, 'Find the special employee'), (4014115, 'Where has Ben been to?'), (4017605, 'Number of employees per department.'), (4017607, 'Which mangers earns more than the average salary of their employees'), (4388082, 'Find certain Employees Working in Dubai or in Sales Department'), (4388083, 'Find most recently hired employees in each department'))

### Delete

In [12]:
qid = input("Enter question ID to be deleted (Questions Table): ")
db.delete_question_by_id(qid)

Enter question ID to be deleted (Questions Table): 12345
Deleted from Questions for variantID=  12345

In [15]:
print("After Delete")
print(db.read_all_questions())

# print(len(db.read_all_questions()))

After Delete
((3689952, 'Toy Database for practice'), (3893280, 'Find hard working students'), (3893281, 'ECE Students taking CS Courses'), (3893282, 'Find students who take courses not from own department'), (3893285, 'Products released before a particular product'), (3893287, 'Who are the best sale shoppers?'), (3893288, 'Who purchased Samsung phones?'), (3902462, 'Looking for grade 15 employees'), (3902464, 'Who is richer than the IT Manager???'), (3902465, 'Looking for Sales Reps or IT Support with salary grade 12 or 13'), (3902466, 'Who works in London'), (3902467, 'Making more than $7000 or not an IT Support!!!'), (4014112, 'Departments with the highest number employees!'), (4014114, 'Find the special employee'), (4014115, 'Where has Ben been to?'), (4017605, 'Number of employees per department.'), (4017607, 'Which mangers earns more than the average salary of their employees'), (4388082, 'Find certain Employees Working in Dubai or in Sales Department'), (4388083, 'Find most recently hired employees in each department'))

In [18]:
db.read_query(1422)

((1422, 8888, 12345, "SELECT * FROM Oceans WHERE color='blue'"),)

In [19]:
db.delete_query_by_id(1422)

Deleted from Queries for queryNum=  1422

In [20]:
new_all_queries = db.read_all_queries()
print("Number of queries:", len(new_all_queries)) # Should be 1 more than last time we looked

Number of queries: 1418

In [21]:
new_all_queries[1415:]

((1416,
  5768,
  3893285,
  'SELECT p.ProductName, (Select Count(*) From Products p2 Where p2.YearReleased < p.YearReleased AND p.BrandName = p2.BrandName)\nFrom Products p \nOrder By p.ProductName'),
 (1417,
  322502,
  3893285,
  'SELECT p1.ProductName, COUNT(p2.YearReleased) - 1\nFROM Products as p1, Products as p2\nWHERE (p1.BrandName = p2.BrandName AND p2.YearReleased < p1.YearReleased) OR\n      (p1.ProductName = p2.ProductName)\nGROUP BY p1.ProductName;\n'),
 (1418,
  35307,
  3893285,
  'SELECT ProductName, (SELECT COUNT(*) FROM Products p WHERE \np.YearReleased < x.YearReleased AND p.BrandName = x.BrandName)\nFROM Products x\nORDER BY ProductName\n\n\n\n\n\n'))

### Advanced Queries

In [24]:
# number of queries per question 
q1="SELECT Questions.variantID, COUNT(*), Questions.title\
    FROM Queries INNER JOIN Questions\
    ON Queries.variantID = Questions.variantID\
    GROUP BY Questions.variantID"
# q1="SELECT Questions.variantID, COUNT(*), Questions.title FROM Queries INNER JOIN Questions ON Queries.variantID = Questions.variantID GROUP BY Questions.variantID"

# only select subset of questions, i.e., all questions about "Courses"
q2="SELECT queryNum, variantID, queryText\
    FROM Queries\
    WHERE variantID IN\
        (SELECT variantID\
         FROM Questions\
         WHERE title LIKE '%Courses%')"
# q2="SELECT queryNum, variantID, queryText FROM Queries WHERE variantID IN (SELECT variantID FROM Questions WHERE title LIKE '%Courses%')"

db.free_query(q1)

SELECT Questions.variantID, COUNT(*), Questions.title    FROM Queries INNER JOIN Questions    ON Queries.variantID = Questions.variantID    GROUP BY Questions.variantID
SQL executed

((3689952, 41, 'Toy Database for practice'),
 (3893280, 186, 'Find hard working students'),
 (3893281, 188, 'ECE Students taking CS Courses'),
 (3893282, 199, 'Find students who take courses not from own department'),
 (3893285, 168, 'Products released before a particular product'),
 (3893287, 149, 'Who are the best sale shoppers?'),
 (3893288, 157, 'Who purchased Samsung phones?'),
 (3902462, 58, 'Looking for grade 15 employees'),
 (3902464, 48, 'Who is richer than the IT Manager???'),
 (3902465,
  36,
  'Looking for Sales Reps or IT Support with salary grade 12 or 13'),
 (3902466, 37, 'Who works in London'),
 (3902467, 33, 'Making more than $7000 or not an IT Support!!!'),
 (4014112, 25, 'Departments with the highest number employees!'),
 (4014114, 8, 'Find the special employee'),
 (4014115, 4, 'Where has Ben been to?'),
 (4017605, 17, 'Number of employees per department.'),
 (4017607,
  18,
  'Which mangers earns more than the average salary of their employees'),
 (4388082,
  45,
  'Find certain Employees Working in Dubai or in Sales Department'),
 (4388083, 1, 'Find most recently hired employees in each department'))

# Advanced Function 1: Clustering SQL queries

Demo Advanced Function 1: Give a brief overview of your advanced function and show us how it works in your project. We will mainly grade in three dimensions (usefulness, technical difficulties, and novelty), so please try to answer the following questions during the demo:

### 1. Implement a parser that replaces/removes aliases for each query

In [25]:
mongo = m.MongoDB('Queries')
example=mongo.read_one_query({})
print(example['rawQueryContent'] + "\n")
print(example['parsedRemovedQuery'])

select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle
from Employee e natural join Department d
where (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and
        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and
        (e.empName like '_a%' or e.empName like '_i%')
order by e.empName asc, d.deptName desc

select empName, annualSalary, deptName, deptLocation, jobTitle
from Employee natural join Department
where (deptLocation = 'Dubai' or deptName = 'Sales') and
        (annualSalary >= 7000 and annualSalary <= 100000) and
        (empName like '_a%' or empName like '_i%')
order by empName asc, deptName desc

### 2. Gather embeddings for parsed queries 

Word2Vec, skip-gram, vector size of 100

### 3. Cluster 
* KMeans (con: requires number of clusters as input) 
* Agglomerative (hierarchical) 
* Mean Shift

### 4. Future work 
- Experiment with different ways of gathering embeddings 
- Utilize other text mining techniques such as TF-IDF to count the number of occurence of each word in each query
- Extract more features, such as "# of subqueries" or "# of tables to join"

### Summary of AF 1

* Usefulness: 
    * An automated way for instructors and TAs to identify weaknesses or common confusions about SQL cocnepts in a classroom. Ex: Most of the class uses 3 subqueries to accomplish a simple task designed to test LEFT JOIN. 

* Does not use database stored procedures--instead, we compute advanced functions in Python (to utilze libraries such as NLTK, SKLearn)

* Technically challenging aspects:
    * Complicated task with difficult evaluation metrics
    * A lot of trial and error--testing multiple features and different embeddings, different methods of parsing
    * Difficult to interpret results without looking through each cluster individually, and analyzing all its SQL queries 
    
* Novelty: 
    * Literature search reveals that very few studies have been conducted on this topic (for SQL specifically) 
    * One other study (Makiyama et al. 2015) has attempted text-mining approaches for clustering query logs for an applications designed for astronomers, but their approach was very different. (End goal: to cluster the types of content retrieved by each user, and they used a more complicated parsing approach instead of Word2Vec embeddings)
    * Most other studies have used a syntax tree, which involves first converting SQL to relational algebra

# Advanced Function 2: MongoDB

MongoDB stores the processed queries, as well as additional features. 


NoSQL databases are more useful for this because we can add and remove properties easily, without needing to change the schema.

In [38]:
# mongo = m.MongoDB('Queries')

In [27]:
# See all queries from Mongo. 
# We only print one because there are ~1400 
all_queries= []
for idx, entry in enumerate(mongo.read_queries({})):
    if idx < 1: 
        print(entry.keys())
        print(entry)
    all_queries.append(entry)

dict_keys(['_id', 'queryNum', 'questionId', 'variantId', 'rawQueryContent', 'test', 'parsedRemovedQuery', 'embedding'])
{'_id': ObjectId('5eaf1fef334f483dd6bb9e34'), 'queryNum': 1, 'questionId': 313665, 'variantId': 4388082, 'rawQueryContent': "select e.empName, e.annualSalary, d.deptName, d.deptLocation, e.jobTitle\nfrom Employee e natural join Department d\nwhere (d.deptLocation = 'Dubai' or d.deptName = 'Sales') and\n        (e.annualSalary >= 7000 and e.annualSalary <= 100000) and\n        (e.empName like '_a%' or e.empName like '_i%')\norder by e.empName asc, d.deptName desc", 'test': 'test2', 'parsedRemovedQuery': "select empName, annualSalary, deptName, deptLocation, jobTitle\nfrom Employee natural join Department\nwhere (deptLocation = 'Dubai' or deptName = 'Sales') and\n        (annualSalary >= 7000 and annualSalary <= 100000) and\n        (empName like '_a%' or empName like '_i%')\norder by empName asc, deptName desc", 'embedding': [-0.10443454231211885, 0.03871216793300309, -0.01633394967581405, 0.04061261953816551, -0.0015831137014949907, 0.04691746959187945, 0.19781399982385947, -0.019764644200684595, -0.15301697890533775, 0.11338640205165157, 0.032955083018932185, 0.2724700644001609, 0.08535128648652406, 0.14450573275384845, -0.08474225367678971, -0.008088625868263304, 0.092657456937872, -0.019022772264224094, -0.022652656725439868, -0.02483887153440995, -0.09213309631240173, -0.20313318250280973, -0.020843970940494148, -0.13620327155059966, 0.07651301108483897, -0.044605314517851734, -0.06078109736401649, -0.05873978852492864, 0.008013989409950913, 0.18372817213845546, -0.0432217700223698, 0.08376205700342773, 0.005034865693143401, -0.12244406682210135, -0.29532661093551604, -0.04758218585773081, -0.01817080925875267, 0.11259202506454265, 0.15733912529149016, 0.2047254461413402, -0.1578353802982687, 0.05320155561031377, 0.006308523663243309, 0.12023628338194284, -0.22108499620293007, -0.1350682972258598, 0.06057881843012407, -0.08210354362477044, -0.17713522252180142, -0.08513857690869357, -0.006936143686781164, 0.07834814860176326, -0.002649125612539346, 0.05229768115591991, 0.09134184959970537, 0.17218832313235788, 0.062468867993257085, -0.09926317838310707, -0.06074701681672061, -0.14650993136169968, -0.09561520668326831, -0.054795243044490696, 0.014261446225258415, 0.06620963940732792, 0.08479940211095038, 0.13685191616980877, 0.019093766972636345, -0.09623065763382149, 0.049318902568555756, 0.0003785293274482743, -0.03199487546321432, 0.045970197045625966, 0.09870721219626606, -0.009468662751014115, 0.11507142073337416, 0.06599806496094851, 0.03183406436831125, -0.00985913715691718, -0.11645716288294948, 0.0009000861070683745, 0.08294803377424108, 0.10590655325347038, -0.030288261441574968, -0.09458038568130282, 0.14507327899031464, 0.036706247733386814, 0.11981317431467478, 0.04130055154979107, 0.01177412784490429, 0.04517754573436057, 0.020095094786498877, -0.006373966250141136, -0.20192278442202044, -0.13855743273848392, -0.074021422708804, 0.13625430445507414, -0.05500498494194424, 0.005579401532829297, 0.017684722559709775, -0.19086566499480215]}

In [28]:
print("Number of queries in Mongo: " + str(len(all_queries)))

Number of queries in Mongo: 1418

In [29]:
# We can also request more specific entries 
mongo.read_one_query({'variantId':3893281})

{'_id': ObjectId('5eaf1ffc334f483dd6bba025'),
 'queryNum': 498,
 'questionId': 313665,
 'variantId': 3893281,
 'rawQueryContent': "SELECT DISTINCT FirstName, LastName, NetId\nFROM Students NATURAL JOIN Enrollments\nWHERE Department='ECE' AND\n(Firstname LIKE 'T%' OR\n    CRN IN(\n        SELECT CRN FROM Courses\n        WHERE Department='CS'\n    )\n    \n)\nORDER BY NetId DESC;",
 'parsedRemovedQuery': "SELECT DISTINCT FirstName, LastName, NetId\nFROM Students NATURAL JOIN Enrollments\nWHERE Department='ECE' AND\n(Firstname LIKE 'T%' OR\n    CRN IN(\n        SELECT CRN FROM Courses\n        WHERE Department='CS'\n    )\n    \n)\nORDER BY NetId DESC;",
 'embedding': [-0.07231595150293096,
  -0.005908395053426686,
  -0.09114630397801336,
  0.08343639112028636,
  0.022593858627308356,
  -0.07317321139730905,
  0.4263666651064628,
  0.07190893911511491,
  -0.07445654939664037,
  0.07364288039235889,
  0.07312979598186518,
  0.20610687254290833,
  0.06114113105362967,
  0.06250769958684319,
  -0.004494752391780678,
  -0.11681203524533071,
  0.008283203565760663,
  -0.01264599259746702,
  0.08136290667186442,
  0.16435870283136242,
  0.09783673614851739,
  -0.2106603494796314,
  -0.02025262785977439,
  0.08127984983576952,
  0.051238120778610834,
  -0.10272952621361535,
  0.04148694162109965,
  -0.187145390498795,
  0.11261840225932629,
  0.1739883306191156,
  -0.12890077651919504,
  0.16333867521270326,
  0.105509796529077,
  -0.04015172304781644,
  -0.037015767277855625,
  -0.16838749316766075,
  0.020206526264940437,
  -0.02647685936014903,
  0.017065971317750058,
  0.06278880651255972,
  -0.009174731345602163,
  0.13953133782764016,
  -0.05490667284711411,
  0.150671983701422,
  -0.15450259256421736,
  0.0020793157531634756,
  0.10917686854372732,
  -0.019944164117700176,
  -0.12393963058620054,
  0.022355986590570722,
  0.04557296520981349,
  0.05087751296186501,
  -0.09848761200708778,
  -0.09048384329837159,
  0.04908322851712767,
  0.1772629500697612,
  0.0717612910819681,
  0.03589643605396544,
  0.02387305469203152,
  0.046146720794862824,
  -0.13494778166243218,
  -0.06944599887356162,
  -0.09231897805033154,
  -0.08713642081343814,
  0.08729680083496005,
  0.008153833326344428,
  0.0002463665349703086,
  0.18097108499588152,
  -0.015730300697645073,
  -0.006872128977097179,
  -0.004555124813984884,
  -0.049295864490743135,
  -0.10549504894420113,
  0.0837199834028357,
  0.08671116226009633,
  -0.11351101803072532,
  -0.0658001859892944,
  -0.02488310530928797,
  0.008483674377202988,
  -0.008103771502838322,
  0.06089314584326195,
  -0.025427217619787706,
  -0.15190353171630322,
  -0.11846848165518359,
  0.17036903823578828,
  -0.0068185549523485335,
  -0.06547844155054343,
  -0.053540355936428044,
  0.0282822617476708,
  -0.01825148396586117,
  0.11300318146516618,
  0.0811159724712764,
  -0.1415944741426134,
  -0.17365883408408417,
  -0.1295419512684212,
  0.009745785843973098,
  -0.15995141937348403,
  0.038828141276577584,
  -0.01638472559371669,
  0.025508635432312365]}

In [30]:
# Read multiple queries fitting your query

for entry in mongo.read_queries({'variantId':3893281}):
    print(entry['queryNum'],entry['variantId'])
    print(entry['parsedRemovedQuery'])
    print("\n")

498 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students NATURAL JOIN Enrollments
WHERE Department='ECE' AND
(Firstname LIKE 'T%' OR
    CRN IN(
        SELECT CRN FROM Courses
        WHERE Department='CS'
    )

)
ORDER BY NetId DESC;


499 3893281
select distinct FirstName, LastName, NetId
from Students
where Department = 'ECE' and
    (FirstName like 'T%' or
     NetId in (select sNetId
                 from Students ss, Enrollments ee, Courses cc
                 where sNetId = ee.NetId and ee.CRN = cc.CRN and cc.Department='CS')
    )
order by NetId DESC;


500 3893281
SELECT FirstName, LastName, NetId
From Students
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR 'CS' = ANY (SELECT DEPARTMENT
FROM Courses
INNER JOIN Enrollments ON Enrollments.CRN = Courses.CRN
WHERE Students.NetId = Enrollments.NetId))
ORDER BY NetId DESC



501 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students Natural join Enrollments
WHERE Department = "ECE" and (SUBSTRING(FirstName, 1, 1) = "T" or CRN in
(
Select CRN
FROM Courses
WHERE Department = "CS"
)
)
Order by Netid desc


502 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM
Students JOIN Enrollments ON NetId = NetId JOIN Courses ON CRN = CRN WHERE ((FirstName LIKE 'T%') OR (Department = 'CS')) AND Department = 'ECE'
ORDER BY NetId DESC
/*FROM Employee emp JOIN Department dept
ON emp.DepartmentID = dept.DepartmentID*/


503 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students NATURAL JOIN Enrollments JOIN Courses on CRN = CRN
WHERE Department = "ECE" AND (Department = "CS" OR FirstName LIKE "T%")
ORDER BY NetId DESC


504 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' And (FirstName LIKE 'T%' OR Exists (Select *
    From Enrollments E Natural Join Courses C
    Where E.NetId = NetId And C.Department = 'CS'))
Order By NetId Desc


505 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE (Department="ECE" AND (FirstName LIKE "T%" OR
    (SELECT COUNT(CRN) FROM Courses WHERE Department="CS" AND CRN IN (Select CRN FROM Enrollments WHERE Enrollments.NetId=Students.NetId))>0 ) )
ORDER BY NetId DESC


506 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
INNER JOIN Enrollments ON NetId = NetId
INNER JOIN Courses ON CRN = CRN
WHERE Department = "ECE" AND (Department = "CS" OR FirstName = "T%")
ORDER BY NetId DESC


507 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM Students
WHERE  Students.Department = "ECE" AND ((Students.FirstName LIKE "T%") OR EXISTS(SELECT Enrollments.NetId FROM Enrollments WHERE Enrollments.NetId =  Students.NetId  AND EXISTS ( SELECT Courses.CRN FROM Courses WHERE Courses.CRN = Enrollments.CRN AND Courses.Department = "CS" )));


508 3893281
select distinct FirstName, LastName, NetId from Students
natural join Enrollments inner join Courses
on CRN = CRN
where (FirstName like 'T%'and department = "ECE")
or (department = "ECE" and  department = "CS")
order by NetId desc


509 3893281
Select Distinct FirstName, LastName, NetId
From Students
Join Enrollments on NetId = NetId
Join Courses on CRN = CRN
Where Department = 'ECE' And (FirstName like 'T%' Or Department = 'CS')
Order by NetId Desc;



510 3893281
SELECT FirstName, LastName, NetId
FROM Students INNER JOIN Enrollments on NetId = NetId
WHERE FirstName LIKE 'T%' and Department='ECE' or (Department = 'ECE'
and (SELECT Department from Courses c WHERE CRN = CRN) = 'CS')
GROUP BY NetId
ORDER BY NetId DESC


511 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students NATURAL JOIN Enrollments
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR NetId IN (
SELECT NetId
FROM Enrollments NATURAL JOIN Courses
WHERE Department = 'CS'))
ORDER BY NetId DESC;


512 3893281
select distinct FirstName, LastName, NetId
from Students join Enrollments on (NetId = NetId), Courses c
where (FirstName like 'T%' and Department = "ECE") or (Department = "ECE" and c.Department = "CS" and CRN = c.CRN)
order by NetId desc;


513 3893281
Select *
from
   (select FirstName, LastName, NetId
    from Students b
    where b.FirstName LIKE "T%" and b.Department = "ECE"
        union
    (select FirstName, LastName, s.NetId
    from (Students s JOIN Enrollments e ON s.NetId = e.NetId )
    where s.Department="ECE" and e.CRN in (Select CRN from Courses h where h.Department="CS")))
order by NetId DESC





514 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR EXISTS
    (SELECT e.CRN
    FROM Enrollments e NATURAL JOIN Courses c
    WHERE NetId = e.NetId AND c.Department = 'CS'))
ORDER BY NetId DESC;


515 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' AND (
      FirstName LIKE 'T%' OR
      EXISTS (SELECT *
              FROM Enrollments, Courses
              WHERE Enrollments.NetId = NetId AND
                    Courses.CRN = Enrollments.CRN AND
                    Courses.Department = 'CS'
             )
    )
ORDER BY NetId DESC



516 3893281
Select FirstName, LastName, NetId
From Students
Where Department = 'ECE' and (FirstName like 'T%' or NetId in (select NetId
from Enrollments e natural join Courses c
where department = 'CS'))
Order by NetId desc


517 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE (Department = "ECE" AND FirstName LIKE "T%")
OR (Department = "ECE" AND
NetId IN
(SELECT DISTINCT(e.NetId) AS NetId
FROM Enrollments e JOIN Courses c
WHERE e.CRN = c.CRN
AND c.Department = "CS"))
ORDER BY NetId



518 3893281
SELECT DISTINCT FirstName, LastName,  NetId FROM
(SELECT FirstName, LastName, NetId, CRN
FROM (SELECT * FROM Students s
WHERE s.Department = 'ECE') AS temp1
NATURAL JOIN Enrollments e) AS
JOIN Courses ON CRN = CRN
WHERE FirstName LIKE 'T%' or Department = 'CS'
ORDER BY NetId DESC


519 3893281
SELECT FirstName, LastName, NetId
FROM
    (SELECT FirstName, LastName, NetId
    FROM Students
    WHERE Department = "ECE")
WHERE (FirstName LIKE 'T%') OR (NetId IN (SELECT DISTINCT NetId
FROM Enrollments e JOIN Courses c ON e.CRN = c.CRN
WHERE Department = "CS"))
ORDER BY NetId DESC


520 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE (
        Department='ECE'
        AND NetId IN (
            SELECT e2.NetId
            FROM Enrollments e2
            NATURAL JOIN Courses c2
            WHERE c2.Department='CS'
        )
    )
    OR FirstName LIKE 'T%';


521 3893281
SELECT FirstName, LastName, NetId
FROM  (SELECT * FROM Students WHERE Department = 'ECE') AS
WHERE FirstName LIKE 'T%' OR NetId IN (
    SELECT DISTINCT NetId FROM Enrollments WHERE CRN IN(
    SELECT CRN FROM Courses WHERE Department = 'CS'))
ORDER BY NetId DESC


522 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students, Enrollments, Courses
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR (NetId = NetId AND CRN = CRN AND Department = 'CS'))
ORDER BY NetId DESC;


523 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM Students, Enrollments,Courses
WHERE (Students.FirstName like "T%" and Students.Department = "ECE") or (Students.Department = "ECE" and Enrollments.NetId = Students.NetId and Enrollments.CRN = Courses.CRN and Courses.Department = "CS")
ORDER BY Students.NetId DESC


524 3893281
SELECT DISTINCT FirstName, LastName, NetId
From Students, Enrollments, Courses,(SELECT DISTINCT NetId, Department
From Enrollments, Courses
WHERE CRN = CRN AND Department = "CS") AS Student_taking_CS_Class
WHERE (Department = 'ECE' AND FirstName LIKE "T%") OR (Department = 'ECE' AND NetId = Student_taking_CS_Class.NetId)
ORDER BY NetId




525 3893281
SELECT
    DISTINCT Students.FirstName, Students.LastName, Students.NetId

FROM
    Students, Enrollments, Courses

WHERE
    Students.Department = 'ECE' and Students.FirstName like 'T%' or Students.Department = 'ECE' and Students.NetId = Enrollments.NetId and Enrollments.CRN = Courses.CRN and Courses.Department = 'CS'

Order BY
    Students.NetId DESC;


526 3893281
Select Distinct FirstName, LastName, NetId
From Students Natural Join Enrollments
where Department = 'ECE' And (FirstName Like 'T%' or CRN = any (Select CRN
From Courses where Department = 'CS') )
Order by NetId DESC



527 3893281
Select FirstName, LastName, NetId
From Students, Enrollments, Courses
where FirstName like 'T%' and Department = 'ECE' or Department = 'ECE' and NetId = NetId and CRN = CRN and Department ='CS'
group by NetId
order by NetId desc


528 3893281
SELECT DISTINCT FirstName, LastName, NetId

FROM Students left join Enrollments on NetId = NetId
left join Courses on CRN = CRN

WHERE Department = "ECE" and (Department = "CS" or FirstName LIKE "T%")


ORDER BY NetID DESC



529 3893281
select distinct FirstName, LastName, Netid
from Students
join Enrollments on NetId=NetId
join Courses on CRN=CRN
where Department='ECE' AND (FirstName like 'T%' or Department='CS')
order by NetId desc;


530 3893281
Select DISTINCT FirstName, LastName, NetID
From Students
Where Department = 'ECE' and
( (FirstName = 'T%') OR (EXISTS
  (Select*
From Enrollments e, Courses c
Where netID = e.NetID and e.CRN = c.CRN and c.Department = 'CS'
  ) )
)
Order by NETID desc


531 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM (
    SELECT FirstName, LastName, NetId
    FROM Students
    WHERE Students.Department LIKE "ECE") AS
JOIN Enrollments ON Enrollments.NetId = NetId
JOIN Courses ON Enrollments.CRN = Courses.CRN
WHERE Courses.Department LIKE "CS" OR FirstName LIKE "T%"
ORDER BY NetId DESC


532 3893281
SELECT DISTINCT  s.FirstName, s.LastName, s.NetId
FROM    (
        SELECT DISTINCT e.NetId
        FROM    Courses c LEFT JOIN Enrollments e ON c.CRN = e.CRN
        WHERE  Department LIKE 'CS'
        ) AS joined, Students s
WHERE   joined.NetId = s.NetId AND s.Department LIKE 'ECE'
ORDER BY s.NetId DESC


533 3893281
SELECT DISTINCT FirstName, LastName, Students.NetId
FROM Students, (SELECT Enrollments.NetId FROM Enrollments, Courses WHERE Enrollments.CRN = Courses.CRN AND Courses.Department = 'CS') AS CSTakingStudents
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR CSTakingStudents.NetId = Students.NetId)
Order BY NetId DESC;


534 3893281
SELECT FirstName, LastName, Students.NetId as netid FROM Students INNER JOIN Enrollments on Students.NetId = Enrollments.NetId INNER JOIN Courses on Courses.CRN = Enrollments.CRN WHERE (Students.Department = "ECE" AND Students.FirstName like "T%") OR (Students.Department = "ECE" AND Courses.Department = "CS")
GROUP BY netid
ORDER BY netid DESC



535 3893281
SELECT DISTINCT FirstName, LastName, netId
From Enrollments INNER JOIN Students on NetId = NetId INNER JOIN Courses ON CRN = CRN
WHERE department = "ECE" AND (FirstName LIKE "T%" OR Department = 'CS')
ORDER BY netID DESC


536 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students JOIN Enrollments ON NetId = NetId
WHERE (FirstName LIKE "T%" AND Department = "ECE")
OR (Department = "ECE" AND CRN IN (SELECT CRN FROM Courses WHERE Department = "CS"))
ORDER BY NetId DESC


537 3893281
select distinct FirstName, LastName, NetId
from Students, Enrollments, Courses
where
    NetId = NetId
    and ((Department = "ECE"
    and CRN = CRN
    and Department = "CS")
    or (FirstName like "T%" and Department = "ECE"))
order by NetId desc



538 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
JOIN Enrollments ON NetId = NetId
JOIN Courses on CRN = CRN
WHERE (Department = "ECE" AND FirstName LIKE "T%") OR
(Department = "ECE" AND Department="CS")
ORDER BY NetId DESC;





539 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Enrollments JOIN Students ON NetId = NetId JOIN Courses ON CRN = CRN
WHERE (FirstName LIKE 'T%' OR NetId = ANY(SELECT NetId FROM Enrollments JOIN Students ON NetId = NetId JOIN Courses ON CRN = CRN WHERE Department = 'CS')) AND Department = 'ECE'
ORDER BY NetId DESC;


540 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
NATURAL JOIN Enrollments
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR CRN IN (
    SELECT CRN
    FROM Courses
    WHERE Department = 'CS'))
ORDER BY NetId DESC


541 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = "ECE" AND (FirstName LIKE 'T%' OR EXISTS
                                (SELECT c.Department FROM Courses c, Enrollments e
                                WHERE c.CRN = e.CRN AND e.NetId = NetId AND c.Department = "CS"))

ORDER BY NetId DESC


542 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Enrollments LEFT JOIN Students
ON NetId = NetId LEFT JOIN Courses ON CRN=CRN
WHERE  Department = 'ECE' AND (Department = 'CS' OR FirstName LIKE 'T%')
ORDER BY NetId DESC;


543 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students, Enrollments, Courses
WHERE NetId = NetId AND CRN = CRN
AND Department = "ECE" AND (FirstName LIKE "T%" OR Department = "CS")
ORDER BY FirstName DESC



544 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
From Students, (Enrollments Natural Join Courses)
WHERE Students.Department = "ECE" AND (Students.FirstName Like "T%" OR (Enrollments.NetId = Students.NetId
                                                                    AND Courses.Department = "CS"))
ORDER BY Students.NetId DESC


545 3893281
SELECT DISTINCT FirstName,LastName,NetId
FROM Students
WHERE Department='ECE' AND (
    FirstName LIKE 'T%'
    OR
    EXISTS( SELECT *
            FROM Enrollments NATURAL JOIN Courses
            WHERE NetId=NetId AND Department='CS'
            )
                            )
ORDER BY NetId DESC;


546 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM (
SELECT Students.FirstName, Students.LastName, Students.NetId, Students.Department, Courses.Department as ID
FROM Students
INNER JOIN Enrollments ON Students.NetId=Enrollments.NetId
INNER JOIN Courses ON Enrollments.CRN = Courses.CRN
HAVING Students.Department="ECE" AND ( ID="CS" OR Students.FirstName LIKE "T%")
)
ORDER BY NetId DESC


547 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM
    (SELECT s.FirstName, s.LastName, s.NetId, s.Department, e.CRN
        FROM Students s JOIN Enrollments e ON s.NetId = e.NetId)
    JOIN Courses ON CRN = CRN
WHERE Department = "ECE" AND (Department = "CS" OR FirstName LIKE "T%")
ORDER BY
    NetId DESC;


548 3893281
SELECT DISTINCT FirstName, LastName, NetId
-- FROM Students, Enrollments e LEFT OUTER JOIN Courses ON CRN = CRN
FROM Students, Enrollments e NATURAL JOIN Courses
WHERE ((NetId = NetId) AND (Department = 'ECE') AND ((FirstName LIKE 'T%')
                                                            OR (Department = 'CS')))
ORDER BY NetId DESC;


549 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students

WHERE Department = 'ECE' AND

(NetId IN (SELECT NetId
    FROM Enrollments e JOIN Courses c ON e.CRN = c.CRN
        WHERE c.Department LIKE 'CS')

OR FirstName LIKE 'T%')

ORDER BY NetId DESC;


550 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students LEFT OUTER JOIN Enrollments
    ON NetId = NetId
    LEFT OUTER JOIN Courses
    ON CRN = CRN

WHERE (Department = 'ECE'
       AND (FirstName LIKE 'T%' OR Department = 'CS'))
ORDER BY NetId DESC




551 3893281
SELECT distinct FirstName,LastName,Students.NetId
FROM Students LEFT OUTER JOIN Enrollments
    on Students.NetId = Enrollments.NetId
WHERE Department = 'ECE' AND ((FirstName LIKE 'T%') or Students.NetId IN

(SELECT distinct Enrollments.NetId
FROM Enrollments left outer join Courses
    ON Enrollments.CRN = Courses.CRN
WHERE Department = 'CS'))
ORDER BY NetId DESC;


552 3893281
select distinct Students.FirstName, Students.LastNAME, Enrollments.NetId
from Students  join Enrollments  join Courses
on Students.NetId = Enrollments.NetId and Enrollments.CRN = Courses.CRN
where  (Students.Department="ECE") and (Students.FirstName LIKE "T%" or Courses.Department="CS" )
order by Enrollments.NetId DESC


553 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM (SELECT * FROM Students st NATURAL JOIN Enrollments en WHERE st.Department = "ECE") AS
WHERE FirstName LIKE "T%" OR "CS" = ANY(SELECT Department FROM Courses cr WHERE cr.CRN = CRN)
ORDER BY NetId DESC;


554 3893281
Select DISTINCT FirstName, LastName, NetId from Students where Department = "ECE"  and (Firstname like "T%" or  NetId in (select NetId from Enrollments e join Courses c on e.CRN = c.CRN where c.Department = "CS")) order by NetId desc


555 3893281
SELECT FirstName, LastName, Students.NetId
FROM Students, Enrollments, (SELECT Students.NetId as id FROM Students, Courses, Enrollments WHERE Students.NetId = Enrollments.NetId AND Courses.CRN = Enrollments.CRN AND Courses.Department = 'CS') as temp
WHERE Students.NetId = Enrollments.NetId AND Students.Department = 'ECE' AND (FirstName LIKE 'T%' OR Students.NetId = temp.id)
GROUP BY FirstName, LastName, Students.NetId
ORDER BY Students.NetId DESC


556 3893281
select distinct Students.FirstName, Students.LastName, Students.NetId
from Students
where Students.Department='ECE' and Students.FirstName like 'T%'

union

select distinct Students.FirstName, Students.LastName, Students.NetId
from Students
inner join Enrollments on Enrollments.NetId=Students.NetId and Students.Department='ECE'
inner join Courses on Enrollments.CRN=Courses.CRN and Courses.Department='CS'
order by NetId desc


557 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
INNER JOIN Enrollments ON NetId = NetId
INNER JOIN Courses ON CRN = CRN
WHERE Department = 'ECE' AND (FirstName = 'T%' OR Department = 'CS')
ORDER BY NetId DESC;



558 3893281
select distinct
    FirstName, LastName, NetId
from
    Students, Enrollments, Courses
where (Department = 'ECE' AND FirstName like 'T%')
or NetId in (
    select NetId
    from Students, Enrollments, Courses
    where (Department = 'ECE' and NetId = NetId And CRN = CRN And Department = 'CS')
    )
order by
NetId desc



559 3893281
Select * from
((Select DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM Enrollments INNER JOIN Courses ON Enrollments.CRN = Courses.CRN, Students

where Students.NetId = Enrollments.NetId and Courses.Department = "CS" and Students.Department = "ECE")
UNION
(SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
from Students
where Students.Department = "ECE" and Students.FirstName Like "T%"))
ORDER BY NetId DESC



560 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' AND (FirstName Like 'T%' OR EXISTS (SELECT *
                                                            FROM Enrollments E NATURAL JOIN Courses C
                                                            WHERE NetId = E.NetId AND C.Department = 'CS'))
ORDER BY NetId DESC


561 3893281
SELECT Distinct s.FirstName, s.LastName, s.NetId FROM

(Students s left Join Enrollments e on s.NetId = e.NetId) right join Courses on e.CRN = CRN

WHERE s.Department = 'ECE' and (left(s.FirstName, 1) = 'T' or Department = 'CS');


562 3893281
SElECT FirstName, LastName, NetId
FROM Students
JOIN Enrollments on NetId = NetId
JOIN Courses on CRN=CRN
WHERE Department = "ECE" AND (FirstName="T%" OR department="CS")
GROUP BY NetId
ORDER BY NetId DESC


563 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM Students, Courses, Enrollments
WHERE Students.NetId=Enrollments.NetId and Enrollments.CRN=Courses.CRN
and Students.Department="ECE" and (Students.NetId LIKE 'T%' or Courses.Department="CS")
ORDER BY Students.NetId DESC


564 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students as LEFT OUTER JOIN Enrollments as ON NetId = NetId
LEFT OUTER JOIN Courses as ON CRN = CRN
WHERE (Department = 'CS' AND Department = 'ECE') OR (FirstName LIKE 'T%' AND Department = 'ECE')
ORDER BY NetId DESC


565 3893281
select FirstName, LastName, NetId
from Students
where Department = 'ECE' and
(FirstName like 'T%' or
NetId in
(select e.NetId

599 3893281
SELECT DISTINCT * FROM
(SELECT * FROM
    (
    SELECT FirstName, LastName, NetId
    FROM Students
    WHERE FirstName LIKE 'T%' AND Department = 'ECE'
    ) AS T1
UNION
SELECT * FROM
    (
    SELECT FirstName, LastName, NetId
    FROM Students
    WHERE Department = "ECE" AND
    NetId IN
        (
        SELECT NetId
        FROM Enrollments E
        NATURAL JOIN Courses C
        WHERE C.Department = "CS"
        )
    ) AS T2
) AS
ORDER BY NetId DESC


600 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' AND
		(FirstName LIKE 'T%' OR
        NetId IN (SELECT DISTINCT NetId
			FROM Enrollments JOIN Courses
				ON Enrollments.CRN = Courses.CRN
            WHERE Department = 'CS'))
ORDER BY NetId DESC;


601 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM Students
INNER JOIN Enrollments ON Students.NetId = Enrollments.NetId
INNER JOIN Courses ON Enrollments.CRN = Courses.CRN
WHERE Students.Department = 'ECE' AND ((Students.FirstName LIKE 'T%') OR Courses.Department = 'CS')
ORDER BY Students.NetId DESC;


602 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students, Enrollments, Courses
WHERE ((Department = 'ECE') AND (FirstName LIKE 'T%'))
OR (Department = 'ECE' AND NetId IN (SELECT e2.NetId FROM Enrollments e2, Courses c2
                WHERE e2.CRN = c2.CRN AND c2.Department ='CS'))
ORDER BY NetId desc




603 3893281
SELECT FirstName, LastName, NetId
FROM Students NATURAL JOIN Enrollments NATURAL JOIN Courses
WHERE Department = "ECE" AND (FirstName LIKE "T%" OR Courses.Department = "CS")


604 3893281
SELECT DISTINCT S1.FirstName, S1.LastName, S1.NetId
FROM ((Enrollments E1
INNER JOIN Courses C1 ON C1.CRN = E1.CRN)
INNER JOIN Students S1 on S1.NetId = E1.NetId)
WHERE S1.Department = 'ECE' AND (S1.FirstName LIKE 'T%' OR C1.Department = 'CS')
ORDER BY S1.NetId DESC;


605 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Enrollments LEFT JOIN Students
ON NetID = NetId LEFT JOIN Courses
ON CRN = CRN
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR Department = 'CS')
ORDER BY NetId DESC;


606 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR NetID IN (SELECT e.NetId FROM Enrollments e NATURAL JOIN Courses c WHERE c.Department = 'CS'))
ORDER BY NetId DESC;


607 3893281
SELECT DISTINCT
    FirstName,
    LastName,
    NetId
FROM
    Students
    JOIN Enrollments
        ON NetId = NetId
    JOIN Courses
        ON CRN = CRN
WHERE
    Department = "ECE"
    AND (
        FirstName LIKE "T%"
        OR
        Department = "CS"
    )
ORDER BY
    NetId DESC


608 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students INNER JOIN Enrollments ON NetId = NetId
       INNER JOIN Courses ON CRN = CRN

WHERE Department = "ECE" AND (FirstName = "T%" OR Department = "CS")
ORDER BY NetId DESC




609 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students AS
INNER JOIN Enrollments AS ON NetId = NetId
INNER JOIN Courses as ON CRN = CRN
WHERE FirstName LIKE 'T%' AND Department = "ECE" OR Department = "ECE" AND Department = "CS"
ORDER BY NetId DESC;



610 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM Students JOIN Enrollments ON Students.NetId = Enrollments.NetId JOIN Courses ON Courses.CRN = Enrollments.CRN
WHERE (Students.Department = 'ECE' AND Students.FirstName LIKE "T%") OR (Students.Department = 'ECE' AND Courses.Department = 'CS')
ORDER BY Students.NetId DESC


611 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students,   (SELECT e.NetId
                    FROM Enrollments e, Courses c
                    WHERE e.CRN = c.CRN and c.Department = "CS") cs_NetIds
WHERE Department = "ECE" AND
(FirstName Like "T%" OR NetId = cs_NetIdNetId)
ORDER BY NetId  DESC




612 3893281
SELECT distinct FirstName, LastName, NetId
From Students, Enrollments, Courses
WHERE Department = "ECE" and ((FirstName LIKE "T%" ) OR (NetId = NetId and CRN = CRN and Department = "CS"))
Order by NetId DESC


613 3893281
SELECT FirstName, LastName, Students.NetId
FROM Students, Enrollments, Courses
WHERE Students.Department = "ECE" AND (FirstName LIKE 'T%' OR (Courses.Department = "CS" AND Courses.CRN = Enrollments.CRN AND Enrollments.NetId = Students.NetId))
ORDER BY Students.NetId DESC


614 3893281
SELECT DISTINCT FirstName, LastName, NetID
FROM Students, Enrollments, Courses
WHERE Department = 'ECE' and (FirstName LIKE 'T%' or (NetId = NetID and CRN = CRN and Department = 'CS'))
ORDER BY NetID DESC



615 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
JOIN Enrollments ON NetId = NetId
JOIN Courses ON CRN = CRN
WHERE Department = "ECE" AND LEFT(FirstName, 1) = "T"
OR Department = "ECE" AND Department = "CS"
ORDER BY NetId;



616 3893281
SELECT Distinct FirstName, LastName, NetID
FROM Students Natural Join Enrollments, Courses
WHERE (FirstName LIKE 'T%' AND Department = "ECE") OR (Department = "ECE" AND CRN = CRN AND  Department = "CS")
ORDER BY NetId DESC


617 3893281
SELECT FirstName, LastName, NetId
from (select * from Students where Department = 'ECE')
where FirstName like 'T%' or NetId in (
  select DISTINCT NetId from Enrollments where CRN in (
    select CRN from Courses where Department = 'CS'
  )
)
Order by NetId DESC


618 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students, Enrollments, Courses
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR (NetId = NetId AND CRN = CRN AND Department = 'CS'))
ORDER BY NetId DESC


619 3893281
select distinct FirstName, LastName, NetId
    from (Students s Natural Join Enrollments e)
    Join
        -- Join Courses c on e.CRN = c.CRN
        -- group by FirstName, LastName
        (select c.Department, c.CRN from Courses c) on e.CRN = CRN
    where s.Department = 'ECE' and (FirstName like 'T%' or Department = 'CS')
    order by NetId desc
    ;


620 3893281
select FirstName, LastName, NetId
from Students
where NetId in (select distinct S.NetId
from Students S, Enrollments E, Courses C
where S.department = "ECE" &&
    ((S.NetId = E.NetId && E.crn = C.crn && C.Department = "CS") || S.FirstName like "T%"))


621 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' and (FirstName LIKE 'T%' or EXISTS (SELECT*
                                    FROM Enrollments E, Courses C
                                    WHERE E.NetId = NetID and E.CRN = C.CRN and C.Department = 'CS'
                                                                ))
ORDER BY NetId DESC;


622 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department LIKE "ECE" AND (FirstName LIKE "T%" OR EXISTS (
SELECT e.NetId
FROM Enrollments e JOIN Courses c ON c.CRN = e.CRN
WHERE c.Department LIKE "CS" AND e.NetId = NetId))
ORDER BY NetId DESC;



623 3893281
SELECT DISTINCT Firstname, Lastname, NetId
FROM Students
WHERE (Department='ECE' AND Firstname LIKE 'T%') OR (Department='ECE' AND NetId in(SELECT NetId FROM Enrollments natural join Courses WHERE Department='CS'))
ORDER BY NetId DESC


624 3893281
select Students.FirstName, Students.LastName, Students.NetId
from Students
where Students.Department = 'ECE'
AND (Students.FirstName like 'T%'
OR exists (
  SELECT Enrollments.NetId, Enrollments.CRN
  FROM Enrollments
  inner join (
    select Courses.CRN, Courses.Department
    from Courses
    where Courses.Department = 'CS'
  ) as g on g.CRN = Enrollments.CRN
  where Enrollments.NetId = Students.NetId
))
order by Students.NetId desc;


625 3893281
Select Distinct FirstName, LastName, NetId FROM Students
JOIN Enrollments ON NetId=NetId
JOIN Courses ON CRN=CRN
WHERE (FirstName LIKE 'T%' AND Department = "ECE")
OR (Department = "ECE" AND Department = 'CS')
ORDER BY NetId DESC


626 3893281
SELECT DISTINCT ece.FirstName, ece.LastName, ece.NetId
FROM ((SELECT * FROM Students WHERE Department = 'ECE') AS ece NATURAL JOIN Enrollments e) JOIN Courses ON e.CRN = CRN
WHERE ece.NetId = ANY (SELECT DISTINCT e.NetId
                                FROM Enrollments e NATURAL JOIN Courses
                                WHERE Department = 'CS')
ORDER BY ece.NetId DESC







627 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students, Enrollments, Courses C
WHERE Department = "ECE" AND FirstName LIKE "T%"
    OR ( Department = "ECE" AND NetId = NetId AND CRN = CRN
        AND Department = "CS")
ORDER BY NetId DESC


628 3893281
select distinct  FirstName, LastName, NetId from Students
    left join Enrollments on NetId = NetId
    left join Courses on CRN = CRN
    where (Department='ECE' and Department='CS') or (left(FirstName,1)='T'and Department='ECE' )
    order by NetId DESC


629 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students INNER JOIN Enrollments ON NetId = NetId INNER JOIN Courses ON CRN = CRN
WHERE (Department = 'ECE' AND FirstName LIKE 'T%') OR (Department = 'ECE' AND Department = 'CS')
ORDER BY NetId DESC;


630 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students NATURAL JOIN Enrollments
WHERE (FirstName LIKE "T%" AND Department = "ECE") or ( Department = "ECE" AND CRN IN (SELECT CRN
                                          FROM Courses
                                          WHERE Department = "CS"
                                          )
                            )
ORDER BY NetId DESC;


631 3893281
select distinct FirstName, LastName, NetId from Enrollments natural join Students join Courses on CRN = CRN where Department = "ECE" and (FirstName like 'T%' or Department = "CS") order by NetId desc


632 3893281
SELECT DISTINCT Students.FirstName, Students.LastName, Students.NetId
FROM (Students
NATURAL JOIN Enrollments)
JOIN Courses ON Enrollments.CRN = Courses.CRN
WHERE Students.Department = 'ECE' AND (FirstName LIKE 'T%' OR Courses.Department = 'CS')
ORDER BY NetId DESC;


633 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = "ECE" AND (FirstName LIKE "T%" OR NetId IN (SELECT s1.NetId FROM Students s1 NATURAL JOIN Enrollments e JOIN Courses c ON e.CRN = c.CRN WHERE c.Department = "CS"))
ORDER BY NetId DESC


634 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE Department = "ECE" AND (FirstName LIKE "T%" OR NetId IN
    (SELECT NetId FROM Enrollments WHERE CRN IN
        (SELECT CRN FROM Courses WHERE Department = "CS")
    )
) ORDER BY NetId DESC;


635 3893281
select FirstName, LastName, NetId
from Students
where FirstName like "T%" and Department = "ECE"
union
select distinct FirstName, LastName, NetId
from (Students natural join Enrollments e) inner join Courses on e.CRN = CRN
where Department = "CS" and Department = "ECE"
order by NetId desc



636 3893281
SELECT DISTINCT S.FirstName, S.LastName, S.NetId
FROM Students AS S, Enrollments AS E, Courses AS C
WHERE S.Department = "ECE" AND
    (S.FirstName LIKE 'T%' OR (S.NetId = E.NetId
        AND E.CRN = C.CRN
        AND C.Department = 'CS'))
ORDER BY S.NetId DESC;


637 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Enrollments INNER JOIN Students ON NetId = NetId
WHERE Department = "ECE" AND (FirstName LIKE "%T" OR CRN IN (
SELECT CRN
FROM Enrollments INNER JOIN Courses C on C.CRN = CRN
WHERE C.Department = "CS" ))
GROUP BY NetId
ORDER BY NetId DESC;


638 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
WHERE Department = "ECE"
AND (FirstName Like "T%"
OR NetId IN  (SELECT e.NetId
                FROM Enrollments e Natural Join Courses c
                WHERE Department = "CS")
)
ORDER BY NetId DESC




639 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students JOIN Enrollments JOIN Courses ON NetId = NetId AND CRN = CRN
WHERE (Department = 'ECE') AND (FirstName LIKE 'T%' OR Department = 'CS')
ORDER BY NetId DESC


640 3893281
select FirstName, LastName, NetID
from Students, Enrollments, Courses
where Department = "ECE" and  NetID = NetID and CRN = CRN
group by  NetID, FirstName, LastName
HAVING left(FirstName, 1) = 'T' or sum(Department = "CS") >= 1
order by netid desc;


641 3893281
SELECT DISTINCT FirstName, LastName, Students.NetId
FROM Students
JOIN Enrollments ON Students.NetId = Enrollments.NetId
JOIN Courses ON Courses.CRN = Enrollments.CRN
WHERE
Students.Department = "ECE" AND (Courses.Department = "CS" OR FirstName LIKE 'T%')
ORDER BY Students.NetId desc;



642 3893281
SELECT FirstName, LastName, NetId FROM (SELECT * FROM Students S NATURAL JOIN Enrollments E WHERE S.Department = "ECE") as JOIN Courses ON CRN = CRN WHERE Department = "CS" OR FirstName = "T%"


643 3893281
select distinct FirstName, LastName, Students.NetId
from ((Students
inner join Enrollments on Students.netId = Enrollments.NetId)
inner join Courses on Enrollments.CRN = Courses.CRN)
where FirstName like 't%'
and Students.Department = 'ECE' or
Courses.Department Like 'CS'
and Students.Department = 'ECE'
order by NetId desc;


644 3893281
select distinct FirstName, LastName, NetID
from Students, Enrollments, Courses
where Department = 'ECE' and (FirstName like 'T%' or (NetId = NetId and CRN=CRN and Department = 'CS'))
order by NetId desc;


645 3893281
SELECT DISTINCT FirstName, LastName, Students.NetId
FROM Students
WHERE Department = 'ECE'
AND (FirstName LIKE 'T%'
OR NetId IN (
SELECT Enrollments.NetId
FROM Enrollments NATURAL JOIN Courses
WHERE Courses.Department = 'CS'
)
)
ORDER BY NetId DESC


646 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE (NetId IN
    (SELECT DISTINCT NetId /*Select Netids of students taking CS Courses*/
    FROM Enrollments
    WHERE CRN IN
        (SELECT CRN  /*Select CS Courses*/
        FROM Courses
        WHERE Department = 'CS')) AND Students.Department = 'ECE') OR (Students.Department = 'ECE' AND Students.FirstName = 'T%')
ORDER BY NetId DESC


647 3893281
SELECT FirstName, LastName, T.NetId
FROM(
SELECT DISTINCT NetID
FROM(SELECT T.NetId, E.CRN
FROM (SELECT NetId
FROM Students
WHERE Department = 'ECE') as T, Enrollments E
WHERE E.NetId = T.NetId) as T, Courses C
WHERE C.CRN = T.CRN and C.Department = 'CS') as T, Students S
WHERE T.NetId = S.NetId
ORDER BY NetId DESC





648 3893281
select FirstName, LastName, NetId
from Students
where Department = 'ECE' AND
    (FirstName like 'T%' OR EXISTS (select * from Enrollments natural join Courses where Department = 'CS' and NetId = Students.NetId))
order by NetId DESC;



649 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM
(SELECT FirstName, LastName, NetId, CRN, Department
FROM Enrollments e NATURAL JOIN Students s
WHERE Department = "ECE" AND (FirstName LIKE "T%" OR CRN = ANY (SELECT CRN FROM Courses WHERE Department = "CS"))) AS
ORDER BY NetID DESC




650 3893281
SELECT FirstName, LastName, NetID
From Students
Where Department = "ECE" AND (Firstname LIKE 'T%' OR EXISTS (
SELECT *
FROM Enrollments E LEFT OUTER JOIN Courses C ON E.CRN = C.CRN
Where C.Department = "CS" AND E.NetID = NetID))
ORDER BY NetID DESC;


651 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students, Enrollments, Courses
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR
(NetId = NetId AND CRN = CRN AND Department = 'CS'))
ORDER BY NetId DESC


652 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
NATURAL JOIN Enrollments
LEFT OUTER JOIN Courses ON CRN = CRN
WHERE (FirstName LIKE 'T%' AND Department LIKE 'ECE')
    OR (Department LIKE 'ECE' AND Department LIKE 'CS')
ORDER BY NetId DESC


653 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE Department = 'ECE' AND (FirstName LIKE 'T%' OR NetId IN (SELECT e.NetId FROM Enrollments e NATURAL JOIN Courses c WHERE c.Department = 'CS'))
order by NetId desc






654 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students
     JOIN Enrollments ON NetId = NetId
     JOIN Courses ON CRN = CRN
WHERE Department = 'ECE' AND (Department = 'CS' OR FirstName LIKE 'T%')
ORDER BY NetID DESC


655 3893281
select distinct FirstName, LastName, NetId
from Students inner join Enrollments on NetId = NetId inner join Courses on CRN = CRN
where Department = "ECE" and (Department = "CS" or FirstName like "T%")
order by NetId desc


656 3893281
SELECT  DISTINCT FirstName, LastName, NetId
FROM (SELECT FirstName, LastName, NetId FROM Students WHERE Department = 'ECE') AS
WHERE NetId IN (SELECT NetId FROM (SELECT NetId, CRN FROM (SELECT NetId FROM Students WHERE Department = 'ECE') AS ECEStuNetId NATURAL JOIN Enrollments WHERE ECEStuNetId.NetId = Enrollments.NetId) AS ECEStuEnroll NATURAL JOIN (SELECT CRN FROM Courses WHERE Department = 'CS') AS CSCourses WHERE ECEStuEnroll.CRN = CSCourses.CRN) OR FirstName LIKE 'T%'
ORDER BY NetId DESC


657 3893281
SELECT DISTINCT FirstName, LastName, NetID
FROM Students JOIN (Enrollments e JOIN Courses c ON e.CRN = c.CRN) ON NetID = e.NetID
WHERE Department = "ECE" AND (c.Department = "CS" OR FirstName LIKE 'T%')
ORDER BY NetID DESC


658 3893281
select FirstName, LastName, NetId
from Students
where Department = "ECE"
and (
    FirstName like "T%"
    or NetId in (
        select NetId
        from Enrollments natural join (
            select *
            from Courses
            where Department = "CS"
        ) t1
    )
)
order by NetId desc


659 3893281
select distinct Students.FirstName, Students.LastName, Students.NetID
from Students, Courses, Enrollments
where Students.FirstName like 'T%' and Students.Department = "ECE" or Students.Department = "ECE" and Students.NetID = Enrollments.NetID and Enrollments.CRN = Courses.CRN and Courses.Department = "CS"
order by Students.NetID DESC
-- in  or Courses.Department = "CS"


660 3893281
SELECT DISTINCT FirstName,LastName,NetID
FROM Students,Enrollments, Courses
Where Department='ECE' and (FirstName like 'T%' or NetId=NetId and CRN=CRN and Department='CS'
)
ORDER by NetID DESC


661 3893281
SELECT DISTINCT FirstName, LastName, NetId FROM
(
    SELECT FirstName, LastName, NetId, CRN FROM
    (
        SELECT FirstName, LastName, NetId, CRN, Department
        FROM Students NATURAL JOIN Enrollments
        WHERE Department = "ECE"
    ) as ECE
    WHERE EXISTS (SELECT Department, CRN FROM Courses WHERE (ECE.CRN = CRN AND Department = "CS") OR ECE.FirstName = "T%")
)
ORDER BY NetId DESC



662 3893281
SELECT Students.FirstName, Students.LastName, Students.NetId
FROM Students
INNER JOIN Enrollments ON Students.NetId = Enrollments.NetID
INNER JOIN Courses ON Enrollments.CRN = Courses.CRN
WHERE Students.Department = 'ECE' AND (Students.NetId LIKE 'T%' OR Courses.Department = 'CS')
GROUP BY Students.NetId
ORDER BY Students.NetId DESC;


663 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM Students AS
JOIN (SELECT EnrollmentNetId, CourseDepartment
      FROM Enrollments
      JOIN Courses
      ON EnrollmentCRN = CourseCRN) AS
ON NetId = NetId
WHERE (Department = 'ECE' AND (FirstName LIKE 'T%' OR Department = 'CS'))
ORDER BY NetId DESC


664 3893281
select distinct FirstName, LastName, NetId
from Students, Courses c join Enrollments on CRN = CRN
where NetId = NetId AND Department = 'ECE' AND (FirstName like 'T%' OR Department = 'CS')
order by NetId DESC


665 3893281
SELECT FirstName, LastName, NetId
FROM Students
WHERE Department = "ECE" AND (FirstName like "T%" OR EXISTS(SELECT NetId FROM Enrollments NATURAL JOIN Courses
WHERE Department = "CS" AND NetId = NetId))
ORDER BY NetId desc


666 3893281
SELECT *
FROM (

    SELECT FirstName, LastName, NetId
    FROM Students
    WHERE Department = "ECE" and FirstName = "T%"

    UNION

    SELECT  Students.FirstName, Students.LastName, Students.NetId
    FROM Students, Enrollments, Courses
    WHERE Students.Department = "ECE" and Students.NetId = Enrollments.NetId and Enrollments.CRN = Courses.CRN and Courses.Department = "CS"
    )



ORDER BY NetId DESC






667 3893281
SELECT DISTINCT FirstName, LastName, NetId
FROM(SELECT a.FirstName, a.LastName, a.NetId, c.Department
     FROM ( SELECT *
            FROM Students s
            WHERE s.Department = 'ECE'

# End of Demo 

### SQL Analysis

In [ ]:
# db.free_query('INSERT INTO `Queries` (`queryNum`,`queryID`, `VariantID`, `QueryText`) VALUES (888, 324318, 3689952,"SELECT 1,2,3,concat(table_name) FROM information_schema.tables WHERE table_schema = \'student\'")')

In [31]:
import csv
import nltk

In [32]:
## Get keywords 
keywords=set()
with open('sql_reserved_words.csv') as words:
    reader = csv.reader(words)
    for row in reader:
        keywords.add(row[0])

In [33]:
# Read current database queries
raw = db.read_all_queries()
data= []
for entry in raw:
    data.append([entry[0], entry[2].strip()])

In [35]:
# Contents of data:
# 0: qId
# 1: Original query
# 2: Ordered array of keyword occurences
# 3: Dictionary of filtered keywords, by count


for d in data:
    t = nltk.word_tokenize(d[1])
    filtered=[]
    dic={}
    for w in t: 
        word=w.upper()
        if word in keywords:
            filtered.append(word)
            if word in dic:
                dic[word]+=1
            else:
                dic[word]=1
    d.append(filtered)
    d.append(dic)

In [40]:
# Preview ordered list of keywords 
print("Ordered array of keywords occurences for each query: ")
for idx, d in enumerate(data):
    print(d[2])
    
    if idx > 5: 
        break

Ordered array of keywords occurences for each query:
['SELECT', 'FROM', 'WHERE', 'STATISTICS', 'AND', 'LIKE', 'A', 'ORDER', 'BY', 'DESC']
['SELECT', 'FROM', 'WHERE', 'STATISTICS', 'AND', 'LIKE', 'A', 'ORDER', 'BY']
['SELECT', 'FROM', 'NATURAL', 'JOIN', 'WHERE', 'IN', 'SELECT', 'MAX', 'FROM', 'C', 'WHERE', 'AND', 'GROUP', 'BY', 'AND']
['SELECT', 'FROM', 'WHERE', 'IN', 'SELECT', 'MAX', 'FROM', 'C', 'WHERE', 'AND', 'GROUP', 'BY']
['SELECT', 'MAX', 'FROM', 'SELECT', 'FROM', 'NATURAL', 'JOIN', 'C', 'WHERE', 'AS', 'TEMP', 'AS', 'WHERE', 'GROUP', 'BY']
['SELECT', 'FROM', 'SELECT', 'FROM', 'WHERE', 'IN', 'SELECT', 'FROM', 'WHERE', 'AS', 'TEMP', 'WHERE', 'MAX']
['SELECT', 'FROM', 'NATURAL', 'JOIN', 'C', 'WHERE']

In [42]:
# Print dictionary counts of keywords
print("Counts of each keyword for each query: ")
for idx, d in enumerate(data):
    print(d[3])
    
    if idx > 5: 
        break

Counts of each keyword for each query:
{'SELECT': 1, 'FROM': 1, 'WHERE': 1, 'STATISTICS': 1, 'AND': 1, 'LIKE': 1, 'A': 1, 'ORDER': 1, 'BY': 1, 'DESC': 1}
{'SELECT': 1, 'FROM': 1, 'WHERE': 1, 'STATISTICS': 1, 'AND': 1, 'LIKE': 1, 'A': 1, 'ORDER': 1, 'BY': 1}
{'SELECT': 2, 'FROM': 2, 'NATURAL': 1, 'JOIN': 1, 'WHERE': 2, 'IN': 1, 'MAX': 1, 'C': 1, 'AND': 2, 'GROUP': 1, 'BY': 1}
{'SELECT': 2, 'FROM': 2, 'WHERE': 2, 'IN': 1, 'MAX': 1, 'C': 1, 'AND': 1, 'GROUP': 1, 'BY': 1}
{'SELECT': 2, 'MAX': 1, 'FROM': 2, 'NATURAL': 1, 'JOIN': 1, 'C': 1, 'WHERE': 2, 'AS': 2, 'TEMP': 1, 'GROUP': 1, 'BY': 1}
{'SELECT': 3, 'FROM': 3, 'WHERE': 3, 'IN': 1, 'AS': 1, 'TEMP': 1, 'MAX': 1}
{'SELECT': 1, 'FROM': 1, 'NATURAL': 1, 'JOIN': 1, 'C': 1, 'WHERE': 1}

## Trial and Error

In [8]:
import configparser
import pymysql

In [9]:
config = configparser.ConfigParser()
config.read("config.ini")

conn = pymysql.connect(
    host = config.get("Database", "mysql_ip"),
    user = config.get("Database", "mysql_user"),
    passwd = config.get("Database", "mysql_pw"))

mycursor = conn.cursor()
# currently using `SampleQueries` database; can change if we make new one
sql = "USE %s" % "SampleQueries"
mycursor.execute(sql)

0

In [ ]:
"SELECT Questions.questionId, COUNT(*) \
FROM hw1 INNER JOIN Questions \
ON hw1.questionId = Questions.questionId \
GROUP BY Questions.questionId"

"SELECT queryId, questionId \
FROM hw1 WHERE questionId \
NOT IN \
(SELECT questionId FROM Questions WHERE question LIKE '%test%')"

In [12]:
q="SELECT h.questionId, queryId, questionContent, queryContent\
FROM hw1 INNER JOIN Questions on h.questionId=q.questionId"

q1="SELECT Questions.questionId, COUNT(*) FROM hw1 INNER JOIN Questions ON hw1.questionId = Questions.questionId GROUP BY Questions.questionId"


q2="SELECT queryId, questionId FROM hw1 WHERE questionId NOT IN (SELECT questionId FROM Questions WHERE question LIKE '%test%')"

def sql(sql):
#     sql = "SELECT questionid, queryId, questionContent, queryContent FROM hw1 h JOIN Questions q on h.questionId=q.questionId"
    mycursor.execute(sql)
    result = mycursor.fetchall()
    return result

res=sql(q2)
for r in res:
    print(r)

(1, 1)
(2, 1)
(3, 2)
(4, 2)
(5, 2)
(6, 2)
(7, 2)
(8, 1)
(9, 1)
(10, 1)
(11, 0)
(12, 1)
(13, 2)
(14, 3)
(19, 8)
(20, 9)
(24, 13)
(25, 14)
(26, 15)
(27, 16)
(28, 17)
(29, 18)
(30, 19)
(31, 0)
(32, 1)
(33, 2)
(34, 3)
(39, 8)
(40, 9)
(44, 13)
(45, 14)
(46, 15)
(47, 16)
(48, 17)
(49, 18)
(50, 19)
(51, 0)
(52, 1)
(53, 2)
(54, 3)
(59, 8)
(60, 9)
(64, 13)
(65, 14)
(66, 15)
(67, 16)
(68, 17)
(69, 18)
(70, 19)
(71, 0)
(72, 1)
(73, 2)
(74, 3)
(79, 8)
(80, 9)
(84, 13)
(85, 14)
(86, 15)
(87, 16)
(88, 17)
(89, 18)
(90, 19)
(91, 20)
(92, 21)
(93, 0)
(94, 1)
(95, 2)
(96, 3)
(101, 8)
(102, 9)
(106, 13)
(107, 14)
(108, 15)
(109, 16)
(110, 17)
(111, 18)
(112, 19)
(113, 20)
(114, 21)
(115, 1)
(116, 1)
(117, 1)
(118, 1)